var store = [{
    "title": "책 정리   포르노, 섹슈얼리티 그리고 페미니즘",
    "excerpt": "P40 페미니즘 안의 논의 “포르노 논쟁에 있어서 페미니스트들의 개입은, 음란물에의 저항을 통해 몸과 성에 대한 가부장적인 규칙을 붕괴하고자 하는 시도에서 비롯되었다.(윤자영 1998). 그들은 남성 우위의 가부장적 사회에서 여성의 성과 몸이 통제되는 방식에 주목하고 여성의 성적 자율권 확보와 성의 정치화를 통하여 가부장 사회의 성별 권력관계를 훼손시키고 전복시키고자 하였다. 그래서 여성을 상품화하고...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%ED%8F%AC%EB%A5%B4%EB%85%B8,-%EC%84%B9%EC%8A%88%EC%96%BC%EB%A6%AC%ED%8B%B0-%EA%B7%B8%EB%A6%AC%EA%B3%A0-%ED%8E%98%EB%AF%B8%EB%8B%88%EC%A6%98/",
    "teaser": null
}, {
    "title": "책 정리   여덟단어",
    "excerpt": "P9 머리말 “단 제이야기가 끝나고 받아들일 수 잇는 것들은 받아들이고 짓밟고 갈 게 있다면 짓밟으면서, 스스로 생각을 정리하고 삶의 가치를 바로 세우기 바랍니다. 우리 인생은 몇 번의 강의와 몇 권의 책으로 바뀔 만큼 시시하지 않습니다.” P60 본질 “내가 좋아하고 잘할 수 있는 것이 다 본질이냐? 저는 이렇게 이해합니다. 내가 하는...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%EC%97%AC%EB%8D%9F%EB%8B%A8%EC%96%B4/",
    "teaser": null
}, {
    "title": "책 리뷰   어린이와 그림책",
    "excerpt": "기본 정보 지은이 : 마쓰이 다다시 옮긴이 : 이상금 출판사 : 샘터 기간 : 2019.9.15 ~ 2019.10.02 (약 15일) 리뷰 책을 읽으며 마을리딩인 참여하며 그림책에 대한 관한 관심이 생겨 읽게 된 책이다. 책을 읽으면서 울컥하는 마음이 들었다. 이유는 나는 그림책을 읽은 기억이 없는데, 이렇게 다 커서 그림책에 관심갖는 관심을 두는...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%EC%96%B4%EB%A6%B0%EC%9D%B4%EC%99%80-%EA%B7%B8%EB%A6%BC%EC%B1%85/",
    "teaser": null
}, {
    "title": "요즘실존을생각한다",
    "excerpt": "흐르는 한강을 보며 요즘 한강에 자주 온다. 햇빛을 머금고 흘러가는 한강을 보고 있으면 현실을 잊고 싶다. 목적을 모른 채 시작한 삶. 본질보다 실존이 앞선 삶. 삶 속에서 만난 부모님과 친구들과 주변 사람들. 문득 “이 모든 삶이 언젠가는 아득히 잊히지 않을까? 그렇다면 언젠가 사라지는 우리의 삶은 도대체 무슨 의미일까? 왜 사람은...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%9A%94%EC%A6%98%EC%8B%A4%EC%A1%B4%EC%9D%84%EC%83%9D%EA%B0%81%ED%95%9C%EB%8B%A4/",
    "teaser": null
}, {
    "title": "나는 왜 시간관리를 하는가",
    "excerpt": "시간 관리는 왜 해야 할까? 하나의 이유만 말한다면 목표를 달성하기 위함이다. 피터드러커의 말이다. 그럼 질문이 연달아 나온다. 목표 달성은 왜 해야 하며, 목표는 어떻게 세워야 하는지, 목표는 어떻게 달성해야 할지 등이다. 다시 질문해보자. 나는 목표 달성을 위한 ‘시간관리’를 왜 하고 있을까? 시간에 우선순위를 설정하기 위함이다. 1주일을 168시간으로 보고 30분 단위로...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EB%82%98%EB%8A%94-%EC%99%9C-%EC%8B%9C%EA%B0%84%EA%B4%80%EB%A6%AC%EB%A5%BC-%ED%95%98%EB%8A%94%EA%B0%80/",
    "teaser": null
}, {
    "title": "읽는 습관",
    "excerpt": "지난 9월에 ‘마을리딩인 예비교육’에 참여했다. 마을리딩인은 그림책을 읽을 환경이 안 되는 계층에게 그림책 읽어주는 봉사활동이다. 보통 어린아이가 대상이지만 종종 노인분들에게도 읽어준다고 한다. 3주차 교육이 기억에 남는다. 아이들과 상호작용하며 그림책을 읽어주는 행위는 아이들에게 도움이 된다고 한다. 최근엔 유튜브가 아이들에게 인기가 많다고 한다. 하지만 유튜브를 이른 시기에 접하는 아이들은 독해력이 떨어진다고 한다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%9D%BD%EB%8A%94-%EC%8A%B5%EA%B4%80/",
    "teaser": null
}, {
    "title": "다시 아자자",
    "excerpt": "다시 아자자 하는 날이었다. 지난주 잠을 66시간을 잤다. 매일 9.5시간씩 잤다. 그런데도 졸리더라. 일찍 일어나야 하는 동기가 없으면 일어나고 싶지 않다. 참으로 사람의 몸과 마음은 정직하다. 그런데 오늘 형님노트 피드백을 하며 다시금 동기부여를 했다. 뭔가 손에 안 잡힐 때 다시금 처음으로, 기본으로 가는 건 좋다. 그래서 이형님의 영상을 다시 봤다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EB%8B%A4%EC%8B%9C-%EC%95%84%EC%9E%90%EC%9E%90/",
    "teaser": null
}, {
    "title": "요즘실존을생각한다",
    "excerpt": "요즘 사르트르의 구토를 읽는다. 로캉탱이라는 주인공이 구토가 치밀어 오르는 순간들이 등장한다. 아직 소설을 다 읽진 않았지만, 자신의 실존에 대해서 생각하면 허무해서 그렇지 않을까 싶다. 오래된 책이다. 고전이라 말할 수 있다. 예전에는 고전이라 하면 왠지 어렵다고만 느껴졌다. 그런데 내가 좋아하는 작가, 채사장씨가 말했다. “고전은 어려운 것이 아니라 내가 그 책을 읽을만한...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%9A%94%EC%A6%98%EC%8B%A4%EC%A1%B4%EC%9D%84%EC%83%9D%EA%B0%81%ED%95%9C%EB%8B%A4/",
    "teaser": null
}, {
    "title": "책 리뷰   직업으로서의 소설가",
    "excerpt": "기본 정보 지은이 : 무라카미 하루키 옮긴이 : 양윤옥 출판사 : 현대문학 기간 : 2019.11.18 ~ 2019.12.00 (약 12일) 리뷰 무라카미 하루키의 자전적 에세이 책이다. 유명하다는 소설은 한번도한 번도 읽지 않고 제목에 이끌려 구매한 책이다. 반디앤루니스에서 잠깐 읽다가 재미있어서 알라딘에서 구매한 책으로 기억한다. 당시엔 내가 바쁘게 몰두 하던몰두하던 시기라(2015~2019) 잠깐의...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%EC%A7%81%EC%97%85%EC%9C%BC%EB%A1%9C%EC%84%9C%EC%9D%98-%EC%86%8C%EC%84%A4%EA%B0%80/",
    "teaser": null
}, {
    "title": "책 리뷰   기사단장 죽이기1,2",
    "excerpt": "기본 정보 지은이 : 무라카미 하루키 옮긴이 : 홍은주 출판사 : 문학동네 기간 : 2019.11.19 ~ 2019.12.00 (약 12일) 리뷰 무라카미 하루키의 ‘기사단장 죽이기’라는 책을 읽고 있다. 서점이나 기사에서 얼핏 봤던 책 제목인데 “무슨 내용이지?” 했던 기억이 난다. 무라카미 에세이를 읽고 1Q84랑 기사단장 죽이기 중에 초반부를 읽고 더 끌리는 책을...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%EA%B8%B0%EC%82%AC%EB%8B%A8%EC%9E%A5-%EC%A3%BD%EC%9D%B4%EA%B8%B01,2/",
    "teaser": null
}, {
    "title": "나는입장권이필요하다",
    "excerpt": "나는 입장권이 필요하다. 어디로 입장하는 입장권일까? 개발자의 세계로 들어가는 입장권이다. 작가 ‘무라카미 하루키’는 자신의 에세이에서 이렇게 말했다. 운 좋게 문예지 에서 신인상을 받았기 때문에 소설가의 세계로 들어갈 입장권이 생겼다고 말이다. 만약 그 소설이 신인상을 받지 않았더라면 자신은 소설가가 되지 않았을 거라고 한다. (물론 만약이겠지만..) 하지만 자명한 사실이다. 신인상이라는 타이틀은 하루키가...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EB%82%98%EB%8A%94%EC%9E%85%EC%9E%A5%EA%B6%8C%EC%9D%B4%ED%95%84%EC%9A%94%ED%95%98%EB%8B%A4/",
    "teaser": null
}, {
    "title": "책 리뷰   노르웨이의 숲",
    "excerpt": "기본 정보 지은이 : 무라카미 하루키 옮긴이 : 양억관 출판사 : 민음사 기간 : 2019.12.02 ~ 2019.12.04 (약 2일) 리뷰 와타나베, 나오코, 레이코, 미도리가 보여주는 삶과 죽음의 경계. 하루키 특유의 허무감과 무거운 분위기가 잘 어우러진 책이다. 매일 코딩하고 밤늦게 이 책을 읽었다. 늦은 밤에 읽으며 나도 이 책에 푹 빠져들었다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%EB%85%B8%EB%A5%B4%EC%9B%A8%EC%9D%B4%EC%9D%98-%EC%88%B2/",
    "teaser": null
}, {
    "title": "하루키습관",
    "excerpt": "띵언 “저 사람이 바쁠지 안 바쁠지는 저 사람이 결정하는 것이다 . 그냥 연락하고 질문해라.” 생각정리 꾸준히. 하루 1커밋. 하루 6시간 공부. 어제 폭풍같은 코드스쿼드 테스트를 보고 멘붕에 빠지기도 하고 다시 이성적으로 생각하기도 했다. 냉탕과 온탕을 왔다갔다.. 거의 온탕에 있었지만.. 이성마비 아무것도 하기 싫어 유튜브와 영화를 보다가 재미없어서 자야겠다 싶을 때...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%ED%95%98%EB%A3%A8%ED%82%A4%EC%8A%B5%EA%B4%80/",
    "teaser": null
}, {
    "title": "간절함을 기록하자",
    "excerpt": "간절함을 기록하자 우리는 종종 지금 이 간절함을 기억하자고 말한다. 하지만 금방 잊는다. 사람의 기억력은 우리가 내뱉은 말보다 형편없다고 생각한다. 그래서 나는 지금 기록한다. 기록은 기억보다 오래간다. 최근에 입장권이 필요하다는 글을 썼다. 개발자 세계로 들어가는 입장권이 필요했다. 그 입장권은 거창한 대기업 입사가 아니라 체계적인 교육기관으로 들어가는 입장권이다. 다행히, 지금 나는 입장권을...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EA%B0%84%EC%A0%88%ED%95%A8%EC%9D%84-%EA%B8%B0%EB%A1%9D%ED%95%98%EC%9E%90/",
    "teaser": null
}, {
    "title": "63권   오토히메와 타이거",
    "excerpt": "목차 615화 : 표적표적의 저주 616화 : 복수 기념일 617화 : 산호언덕에서 대사건 618화 : 프러포즈 619화 : 바다의 숲에서 620화 : 선망의 놀이공원 621화 : 오토히메와 타이거 622화 : 태양 해적단 623화 : 해적 피셔 타이거 624화 : 오토히메 왕비 625화 : 계승되지 않는 의지 626화 : 넵튠 3형제...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/63%EA%B6%8C-%EC%98%A4%ED%86%A0%ED%9E%88%EB%A9%94%EC%99%80-%ED%83%80%EC%9D%B4%EA%B1%B0/",
    "teaser": null
}, {
    "title": "64권   10만 vs 10",
    "excerpt": "목차 627화 : 그저 고마울 따름 628화 : 대청소 629화 : 막어서는 전 칠무해 630화 : 날뛰기 시작하다 631화 : 공코르드 광장 632화 : 알고 있었다 633화 : 적인가 아군인가 634화 : 10만 vs 10 635화 : 하늘을 날아버릴 만큼 소름 끼치는 636화 : 미래국에서 온 장군 등장인물 새로운 인물은...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/64%EA%B6%8C-10%EB%A7%8C-VS-10/",
    "teaser": null
}, {
    "title": "65권   제로로 ",
    "excerpt": "목차 637화 : 고대의 방주 638화 : 도망호시 639화 : 다 지킨다 640화 : 어인섬 바로 위 641화 : 넌 무어냐 642화 : 체면은 이미 땅바닥에 643화 : 팬텀 644화 : 제로로 645화 : 죽음 또한 복수 646화 : 개구리 등장인물 새로운 인물은 없다. 줄거리 노아를 보내 시라호시와 어인섬을 멸망시키려던...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/65%EA%B6%8C-%EC%A0%9C%EB%A1%9C%EB%A1%9C/",
    "teaser": null
}, {
    "title": "66권   태양으로 이어지는 길",
    "excerpt": "목차 647화 : 멈춰라 노아 648화 : 태양으로 이어지는 길 649화 : 도미와 넙치의 가무 650화 : 알아두어야 할 두 가지 변화 651화 : 신세계에서 날아든 목소리 652화 : 전도다난의 예감 653화 : 영웅의 모자 654화 : GAM(작은 무리) 655화 : 펑크 하자드 656화 : 불타는 섬의 모험 등장인물 새로운...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/66%EA%B6%8C-%ED%83%9C%EC%96%91%EC%9C%BC%EB%A1%9C-%EC%9D%B4%EC%96%B4%EC%A7%80%EB%8A%94-%EA%B8%B8/",
    "teaser": null
}, {
    "title": "67권   cool fight",
    "excerpt": "목차 657화 : 머리통 658화 : 비스킷 룸 659화 : 몸뚱이 이야기 660화 : ‘왕의 부하 칠무해’ 트라팔가 로 661화 : 강도가 나오는 호수 662화 : 칠무해 로 vs 스모커 중장 663화 : CC 664화 : M(마스터) 시저 클라운 665화 : CANDY 666화 : 예티 COOL BROTHERS 667화 : COOL...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/67%EA%B6%8C-COOL-FIGHT/",
    "teaser": null
}, {
    "title": "책 리뷰   hello coding 알고리즘",
    "excerpt": "기본 정보 지은이 : 아디트야 바르가바 옮긴이 : 김도형 출판사 : 한빛미디어 기간 : 2019.10.01 ~ 2019.12.28 (약 3달) 리뷰 1차 완독하는데 3개월이 걸린 책이다. 처음 사서 읽을 땐 절반까진 술술 읽었던 기억이 난다. 당시 개발자 준비하기로 마음 먹고 동기부여가 잔뜩 들어가 있던 시기였다. 자료구조 및 알고리즘이 기초라는 생각에 이...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-Hello-Coding-%EC%95%8C%EA%B3%A0%EB%A6%AC%EC%A6%98/",
    "teaser": null
}, {
    "title": "책 정리   hello coding 알고리즘",
    "excerpt": "목차 알고리즘의 소개 선택 정렬 재귀 퀵 정렬 해시 테이블 너비 우선 탐색 다익스트라 알고리즘 탐욕 알고리즘 동적 프로그래밍 KNN 알고리즘 더 공부해야 할 것 9. 동적 프로그래밍 동적 프로그래밍은 무언가를 최대화하는 것이 목표이다. ex) 배낭 채우기 문제. 동적 프로그래밍을 풀 때는 격자를 활용한다. 최장 공통 부분열(Longest Common Sequence) 만약...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-Hello-Coding-%EC%95%8C%EA%B3%A0%EB%A6%AC%EC%A6%98/",
    "teaser": null
}, {
    "title": "Divide & conquer",
    "excerpt": "삶에 Divide &amp; Conquer를 적용하자. Divide &amp; Conquer. 의역하면 분할 정복이라는 뜻이다. 알고리즘 강의 듣다가 만난 용어이다. 커다란 문제를 잘게 나누고 하나씩 정복한다는 방법이다. 아무리 어렵고 복잡한 문제라도 하나씩 자르고 해결하다 보면 어느새 큰 문제가 해결된다는 사고방식. 최근에 한 번에 하나씩한다는 하나씩 한다는 사고방식이 마음에 든다. 꾸준함과 관련되어 있는된 삶의...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/Divide-&-Conquer/",
    "teaser": null
}, {
    "title": "68권   해적동맹",
    "excerpt": "목차 668화 : 해적동맹 669화 : 작전 개시 670화 : 눈보래 때때로 Slime 671화 : 가스가스 열매 672화 : 이 몸!! 이름은 킨에몬이라 하네!! 673화 : 베르고와 조커 674화 : 방관자들 675화 : 그 이름도 ‘시노쿠니’ 676화 : 완전한 살육병기 677화 : COUNTER HAZARD!! 678화 : 연구소 내 A동 로비...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/68%EA%B6%8C-%ED%95%B4%EC%A0%81%EB%8F%99%EB%A7%B9/",
    "teaser": null
}, {
    "title": "69권   sad",
    "excerpt": "목차 679화 : 기개의 G-5 680화 : 해군 G-5 기지장 ‘귀죽 베르고’ 681화 : 루피 vs M 682화 : 흑막 683화 : 얼음 같은 여자 684화 : 그만둬 베가펑크 685화 : 모모노스케, 이 몸의 이름이다!! 686화 : 비스킷 룸의 설녀 687화 : 맹수 688화 : 모차 689화 : 없는 듯...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/69%EA%B6%8C-SAD/",
    "teaser": null
}, {
    "title": "70권   도플라밍고 나타나다",
    "excerpt": "목차 691화 : 죽음의 나라 왕 692화 : 드레스로자에서 온 자객 693화 : 죽어다오 694화 : 가장 위험한 사나이 695화 : 맡겨!!! 696화 : 이해의 일치 697화 : 거래 698화 : 도플라밍고 나타나다 699화 : 조간 700화 : 놈의 페이스 등장인물 밀집모자 해적당 트라팔가 로우 스모커, 타시기 시저 크라운 여우불...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/70%EA%B6%8C-%EB%8F%84%ED%94%8C%EB%9D%BC%EB%B0%8D%EA%B3%A0-%EB%82%98%ED%83%80%EB%82%98%EB%8B%A4/",
    "teaser": null
}, {
    "title": "책 리뷰   퍼센트, 내 삶을 바꾼 특별한 도구",
    "excerpt": "기본 정보     지은이 : 이준희   옮긴이 :   출판사 : Alivebooks   기간 : 2020.01.03 ~ 2020.00.00 (약 00일)   리뷰  책을 읽으며   책을 읽은 후  ",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%ED%8D%BC%EC%84%BC%ED%8A%B8,-%EB%82%B4-%EC%82%B6%EC%9D%84-%EB%B0%94%EA%BE%BC-%ED%8A%B9%EB%B3%84%ED%95%9C-%EB%8F%84%EA%B5%AC/",
    "teaser": null
}, {
    "title": "과유불급",
    "excerpt": "과유불급이다. 지나친 것은 부족한 것과 같다. 코드스쿼드 4일차에 내가 느끼는 감정이다. 거창하게 과유불급을 썼을까? 내 마음이다 지금 배우는 C.S 기초를 완벽하게 소화시키지 소화하지 못하고 넘어가는 내가 보이기 때문이다. 오늘 배운 건 오늘 정리 확실히 하고 넘어가고 싶은데 어렵더라. 미션의 난이도가 꽤 높기 때문에 거의 7시 다 돼서야 간신히 미션을 구현한다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EA%B3%BC%EC%9C%A0%EB%B6%88%EA%B8%89/",
    "teaser": null
}, {
    "title": "철학   feminism 1 1(update)",
    "excerpt": "목차 페미니즘 철학이란 무엇인가? 인식론 인식론에 대한 비판 정신과 육체 핵심 페미니즘 철학은 인식론에 대한 비판에서 출발한다. 페미니즘 철학이란 무엇인가? 페미니즘 철학은 무엇인가? 여성주의 철학이다. 정확하게 개념이 이해되는 단어가 아니기 때문에 혼동이 올 순 있다. 페미니즘은 알겠는데 페미니즘 철학은 무엇인가? 하는 의문도 든다. 페미니즘은 인식론에 관한 비판에서 출발한다. 인식론 근대...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-1-1(update)/",
    "teaser": null
}, {
    "title": "답답함",
    "excerpt": "나는 지금 답답하다. 무언가 알 듯 말 듯한데 명확하게 이해하고 코드로 구현할 수 없어서 답답하다. 지난주 학원에서 객체 지향 프로그래밍(OOP)를 배웠다. 자바의 핵심 개념이라 반드시 이해하고 싶었다. 상속을 바탕으로 구현해야 했다. 당일에는 그냥 좌표 입력 받으면 입력받으면 계산만 하는 프로그램을 만들고 제출했다. 상속의 개념을 알고 있으나 실제 코드에 적용하지 못하니...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EB%8B%B5%EB%8B%B5%ED%95%A8/",
    "teaser": null
}, {
    "title": "시간을 투자한다는 말",
    "excerpt": "나는 시간을 투자한다는 말을 자주 사용한다. 시간을 하나의 자원으로 인식하기 때문에 하는 말이다. 당연한 말을 굳이 썼네요 그도 그럴 것이. 나는 내 모든 시간을 기록하고 관리한다. 이를 위해 커뮤니티도 참여한다. 그만큼 시간은 나에겐 귀중한 자원이다. 내가 주말에 개발 공부하는 걸 시간 투자한다고 글에 적었다. 그런데 무언가 낯선 기분이 들었다. ‘개발자가...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%8B%9C%EA%B0%84%EC%9D%84-%ED%88%AC%EC%9E%90%ED%95%9C%EB%8B%A4%EB%8A%94-%EB%A7%90/",
    "teaser": null
}, {
    "title": "철학   feminism 1 2",
    "excerpt": "참고 강의 : 페미니즘 철학 입문 - 김은주 목차 철학의 신체 혐오(기피) 철학에서 여성의 위치 : 타자 핵심 여성이 타자로 존재했다는 말의 의미를 알았다. 철학의 신체 혐오(기피) 철학은 오랫동안 영혼을 중시하고 신체를 혐오했다. 혐오라는 말이 세다면 기피라고 이해해도 된다. 철학자가 생각하기에 진리라는 건 영원하고 불변해야 한다고 생각했다. 하지만 그에 반해...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-1-2/",
    "teaser": null
}, {
    "title": "창피할 게 무엇이 있는가",
    "excerpt": "학원에서 페어 프로그래밍을 했다. 하나의 주제를 가지고 2명이서 함께 미션을 해결하는 방법이다. 이 때 개발 실력이 차이가 나면 한 사람은 주눅들기 마련이다. 상대방이 주눅 안 들게 해줄 수도 있지만 자연스레 움츠러드는 건 있다. 오늘 내가 그랬다. 짝꿍이 코드 설계도 척척하고 코드 짜는 실력도 더 좋았다. 이 때 나는 ‘이 사람이...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B0%BD%ED%94%BC%ED%95%A0-%EA%B2%8C-%EB%AC%B4%EC%97%87%EC%9D%B4-%EC%9E%88%EB%8A%94%EA%B0%80/",
    "teaser": null
}, {
    "title": "철학   feminism 1 3",
    "excerpt": "참고 강의 : 페미니즘 철학 입문 - 김은주 목차 타자는 괴물로 등장한다. 철학은 더 이상 보편을 다루지 않는다. 김은주 강사의 페미니즘 철학이란 핵심 타자에 대한 조명은 반드시 필요하다. 타자는 괴물로 등장한다. 철학에서 타자는 ‘Not A’라고 설명되는 것들을 말한다. 타자 그 자체로 자신을 표현하기는 어렵다. 여기서 ‘것들’이라 표현한 이유는 타자가 지식도...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-1-3/",
    "teaser": null
}, {
    "title": "철학   ubuntu",
    "excerpt": "ubuntu란? 나는 우분투를 리눅스의 배포판으로 처음 만났다. 평생을 마이크로소프트 운영체제를 사용하다가 ‘백엔드 개발자는 리눅스에 익숙해져야 한다’는 호눅스의 말을 듣고 설치했다. 리눅스는 오픈 소스이기 때문에 다양한 배포판이 있는데 그 중 가장 개인 사용자가 사용하기 편한 배포판이 우분투이다. 우분투 배포판은 왜 우분투라는 의미를 사용했을까? 우분투는 아프리카의 공동체 정신으로 표현된다. ‘사람은 다른 사람을...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Ubuntu/",
    "teaser": null
}, {
    "title": "철학   feminism 1 4",
    "excerpt": "참고 강의 : 페미니즘 철학 입문 - 김은주 목차 페미니즘 철학이란? 현대 철학은 땅을 바라본다. 핵심 철학은 이제 땅을 바라본다. 페미니즘 철학이란? 지난 시간에 이어서 페미니즘 철학을 이야기한다. 페미니즘 철학에 대한 오해는 이러하다. 기존 철학에 대해 반대하는 철학, 여성만을 위한 철학, 여성만 하는 철학이다. 하지만 페미니즘 철학은 이런 것이 아니다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-1-4/",
    "teaser": null
}, {
    "title": "1억명이 사용한다 상상하라",
    "excerpt": "백엔드 개발자를 준비하면서 처음 접했던 강의는 생활코딩이다. 입문 시기에 원리를 설명해주는 egoing님의 설명을 들으며 Java나 JS, Python에 친숙해졌다. 아직도 초보지만 강의 중 egoing님이 자주 하시는 말이 있다. 바로 ‘이 코드가 1억 명이 쓰는 애플리케이션이라고 상상하라’는 말이다. 처음엔 ‘그래야 이해가 잘 되나보다’라고 머리로 이해했지만 이제는 피부로 느끼고 있다. 물론 내가 지금...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/1%EC%96%B5%EB%AA%85%EC%9D%B4-%EC%82%AC%EC%9A%A9%ED%95%9C%EB%8B%A4-%EC%83%81%EC%83%81%ED%95%98%EB%9D%BC/",
    "teaser": null
}, {
    "title": "책 정리   1독 객체 지향의 사실과 오해",
    "excerpt": "목차 협력하는 객체들의 공동체 이상한 나라의 객체 타입과 추상화 역할, 책임, 협력 책임과 메세지 객체 지도 함께 모으기 부록A / 추상화 기법 부록B / 참고 문헌 1. 협력하는 객체들의 공동체 역할이라는 단어는 의미적으로 책임이라는 개념을 내포한다. p.27 객체지향 설계라는 예술은 적절한 객체에게 적절한 책임을 할당하는 것에서 시작된다. p.30 과거의 전통적인...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-1%EB%8F%85-%EA%B0%9D%EC%B2%B4-%EC%A7%80%ED%96%A5%EC%9D%98-%EC%82%AC%EC%8B%A4%EA%B3%BC-%EC%98%A4%ED%95%B4/",
    "teaser": null
}, {
    "title": "책 리뷰   객체지향의 사실과 오해",
    "excerpt": "기본 정보 지은이 : 조영호 출판사 : 위키북스 기간 : 2020.01.15 ~ 2020.01.24 (약 09일) 리뷰 책도 저작권이 있기 때문에 책 내용에 대한 리뷰보단 책을 읽은 후 드는 생각에 대해서 적겠습니다. 어려웠던 객체지향 프로그래밍(이하 OOP)에 대한 원리를 이해 시켜주는 책이다. 학원에서 OOP에 대한 수업을 듣고 백엔드 개발자를 준비하는 나는 OOP에...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%EA%B0%9D%EC%B2%B4%EC%A7%80%ED%96%A5%EC%9D%98-%EC%82%AC%EC%8B%A4%EA%B3%BC-%EC%98%A4%ED%95%B4/",
    "teaser": null
}, {
    "title": "정말로 사랑한다면(noupload)",
    "excerpt": "정말로 사랑한다면 기다려주세요. 내가 좋아하는 가수 장범준의 노래 중 하나이다. 원 제목은 ‘정말로 사랑한다면’이다. 정말로 사랑한다면 기다려달라고 말한다. 여기서 기다린다는 것은 감정에 앞선 섣부른 표헌이 아닐까 싶다. 사랑을 표현하는 건 정말 말이나 동작으로 표현해야만 알 수 있을까? 정말로 사랑한다면 인스턴트같은 감정 표현은 남발하면 안 될 거 같다.   ",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%A0%95%EB%A7%90%EB%A1%9C-%EC%82%AC%EB%9E%91%ED%95%9C%EB%8B%A4%EB%A9%B4(noUpload)/",
    "teaser": null
}, {
    "title": "철학   feminism 2 1",
    "excerpt": "참고 강의 : 페미니즘 철학 입문 - 김은주 목차 페미니즘 철학의 제 1물결 여권의 옹호 등장 배경 오늘날은? 핵심 페미니즘 철학의 1물결은 양성 평등에 대한 주장이다. 지난 시간 복습 페미니즘 철학은 여성만을 위한 철학이 아니다. 오랜 시간 보편 인간이라 불린 기준에 대한 문제 제기이며, 다양한 타자에 관한 관심이다. 이분법에 대해...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-2-1/",
    "teaser": null
}, {
    "title": "책 정리   2독 객체지향의 사실과 오해",
    "excerpt": "목차 협력하는 객체들의 공동체 1. 협력하는 객체들의 공동체 키워드 정의 역할 : 객체가 수행하는 책임의 집합 책임 : 객체에게 온 메세지 또는 그 메세지에 응답하는 것. 자율성 : 객체 스스로 프로퍼티를 관리하고 외부와는 정해진 메세지로만 소통하는 것. 외부에선 객체가 무엇(what)을 하는 지는 알 수 있지만 어떻게(how)하는 지는 알 수 없다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-2%EB%8F%85-%EA%B0%9D%EC%B2%B4%EC%A7%80%ED%96%A5%EC%9D%98-%EC%82%AC%EC%8B%A4%EA%B3%BC-%EC%98%A4%ED%95%B4/",
    "teaser": null
}, {
    "title": "연애와 취업준비의 비슷함에 대해",
    "excerpt": "오늘 산책하며 든 생각이다. 연애와 취업 준비는 비슷하다. 연애를 하려면 나를 좋아해주는 사람을 만나야 한다. 그런데 모든 사람이 나를 좋아해주지 않는 게 현실이기 때문에 내 매력을 어필해야 한다. 하지만 내 매력이 어떤 사람에게는 통하지만 어떤 사람에게는 통하지 않을 수 있다. 때로는 연속적으로 내 매력을 못 느끼는 사람을 만날 수도 있다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%97%B0%EC%95%A0%EC%99%80-%EC%B7%A8%EC%97%85%EC%A4%80%EB%B9%84%EC%9D%98-%EB%B9%84%EC%8A%B7%ED%95%A8%EC%97%90-%EB%8C%80%ED%95%B4/",
    "teaser": null
}, {
    "title": "마음은 아는데 몸이 안 움직일 때",
    "excerpt": "마음은 무엇을 해야할 지 아는데 몸이 안 움직일 때가 있다. 또는 다른 행동을 할 때가 있다. 전문 용어로 인지부조화라고 하던데.. 참 신기한 현상이다. 마음 한 구석에는 지금 내가 무엇을 해야 생산적일지 아는데, 몸은 유튜브를 본다. 유튜브를 보는 것도 엄청 즐거워서 보는 것도 아니다. 그냥 시간을 보낸다. 그 시간에 해야할 개발...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EB%A7%88%EC%9D%8C%EC%9D%80-%EC%95%84%EB%8A%94%EB%8D%B0-%EB%AA%B8%EC%9D%B4-%EC%95%88-%EC%9B%80%EC%A7%81%EC%9D%BC-%EB%95%8C/",
    "teaser": null
}, {
    "title": "철학  feminism 2 2",
    "excerpt": "목차 메리 울스턴크래프트의 가정 프랑스 혁명을 경험한 후 내 생각 메리 울스턴크래프트의 가정 메리 울스턴크래프트(이하 울스턴크래프트)의 가정은 평탄하지 못했다고 한다. 아버지가 어머니에게 가정폭력을 했다고 하는데, 그 때 울스턴크래프트는 어머니가 어디에도 호소하지 못하는 법 제도를 본다. 당시 여성은 결혼을 하면 법적 권리가 남편에게 양도된다. 그래서 만약 폭력이 일어나도 집안일이라 치부되며 호소할...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-2-2/",
    "teaser": null
}, {
    "title": "과거의 나를 보는 기분",
    "excerpt": "요즘 한창 GIt에 대해서 배우고 있다. 코드스쿼드 피드백 방식이 GIt의 pull request를 통해 이루어지기 때문이다. Git 자체도 어려운데 Git을 통해 의사소통을 한다니..! 지금 어렵지만 배워두면 훗날 유용하게 쓰이겠다는 생각을 한다. 호눅스의 Github 책을 정독하며 공부하고 있다. 실습을 하려고 새로운 Github 저장소를 만드려고 했는데 기존에 만들어 놓은 저장소가 있었다. 무슨 용도인가...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EA%B3%BC%EA%B1%B0%EC%9D%98-%EB%82%98%EB%A5%BC-%EB%B3%B4%EB%8A%94-%EA%B8%B0%EB%B6%84/",
    "teaser": null
}, {
    "title": "책 정리   팀 개발을 위한 git & github 시작하기",
    "excerpt": "CodeSquadC.S 저장소 git 파일에 정리해 놓음.   위치 : https://guswns1659.tistory.com/125  ", "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%ED%8C%80-%EA%B0%9C%EB%B0%9C%EC%9D%84-%EC%9C%84%ED%95%9C-Git-&-GitHub-%EC%8B%9C%EC%9E%91%ED%95%98%EA%B8%B0/",
    "teaser": null
}, {
    "title": "책 리뷰   팀개발을 위한 git & github 시작하기",
    "excerpt": "기본 정보 지은이 : 정호영, 진유림 출판사 : 한빛미디어 기간 : 2020.02.01 ~ 2020.02.14 (약 14일) 리뷰 깃은 나에게 어려운 기술이었다. 학교에서 빅데이터 교육 과정을 이수할 때 깃이 좋다는 이야기를 많이 들었다. 개발자라면 깃으로 코드를 관리해야 한다고 해 깃을 공부했던 적이 있다. 하지만 깃의 명성답게서 악명일 수도.. 혼자 하려니 어려워서...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%ED%8C%80%EA%B0%9C%EB%B0%9C%EC%9D%84-%EC%9C%84%ED%95%9C-Git-&-GitHub-%EC%8B%9C%EC%9E%91%ED%95%98%EA%B8%B0/",
    "teaser": null
}, {
    "title": "책 정리   do it 알고리즘 입문",
    "excerpt": "목차 기본 알고리즘 기본 자료구조 검색 스택과 큐 재귀 알고리즘 정렬 집합 문자열 검색 리스트 트리 해시 1. 기본 알고리즘 순서도(flowchart)의 기호 단말(terminator) : 외부 환경으로 나가거나 외부 환경에서 들어오는 것을 나타낸다. 프로그램의 시작과 끝을 의미한다. 데이터(Data) : 입력과 출력을 나타낸다. 처리(Process) : 연산 등을 실행한다. 미리 정의한 처리 :...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-Do-it-%EC%95%8C%EA%B3%A0%EB%A6%AC%EC%A6%98-%EC%9E%85%EB%AC%B8/",
    "teaser": null
}, {
    "title": "철학   feminism 2 3",
    "excerpt": "목차 소년들만 의무교육을? 당시 지식인에 대한 분노 내생각 소년들만 의무교육을? 프랑스 혁명이 성공한 뒤 모든 인간은 존엄하고 교육을 받아야 한다는 생각 아래 교육 법안이 만들어 진다. 그런데 그 교육에는 소년은 의무교육에 포함되지만 소녀는 포함되지 않았다. 이에 울스턴크래프트는 반발한다. 모든 인간이 존엄하다면서 여성에 대한 교육은 왜 없는 것인가! 영혼에는 성별이 없다고까지...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-2-3/",
    "teaser": null
}, {
    "title": "책 리뷰   그림으로 배우는 http & network basic",
    "excerpt": "기본 정보 지은이 : 우에노 센 옮긴이 : 이병억 출판사 : 영진닷컴 기간 : 2020.02.14 ~ 2020.02.22 (약 08일) 리뷰 HTTP와 NetWork의 기본기를 다질 수 있는 책이다. 제목 그대로 그림으로 설명하기 때문에 대체로 이해가 쉽다. 대체로다.. 어려우실 수도 있다 대체로라고 적은 이유는 나도 처음 이 책을 볼 땐 하나도 이해가...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%EA%B7%B8%EB%A6%BC%EC%9C%BC%EB%A1%9C-%EB%B0%B0%EC%9A%B0%EB%8A%94-Http-&-Network-basic/",
    "teaser": null
}, {
    "title": "책 정리   그림으로 배우는 http & network basic",
    "excerpt": "목차 웹과 네트워크의 기본에 대해 간단한 프로토콜 HTTP HTTP 정보는 HTTP 메세지에 있다. 결과를 전달하는 HTTP 상태 코드 HTTP와 연계하는 웹서버 HTTP 헤더 웹을 안전하게 하는 HTTPS 누가 엑세스하고 있는지를 확인하는 인증 HTTP에 기능을 추가한 프로토콜 웹 콘텐츠에서 사용하는 기술 웹 공격 기술 1장 웹과 네트워크의 기본에 대해 WWW을 구성하는...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%EA%B7%B8%EB%A6%BC%EC%9C%BC%EB%A1%9C-%EB%B0%B0%EC%9A%B0%EB%8A%94-Http-&-Network-basic/",
    "teaser": null
}, {
    "title": "철학   feminism 2 4",
    "excerpt": "목차 미래엔 신체가 아닌 이성으로 사람을 판단한다. 울스턴 크래프트의 한계 그럼에도 그녀가 중요한 이유 미래엔 신체가 아닌 이성으로 사람을 판단한다. 울스턴크래프트는 미래에는 신체의 차이로 사람을 판단하지 않고 이성을 가지고 판단한다고 생각했다. 판단한다는 의미가 부정적일 수 있지만 좋고 나쁨을 나눈다는 의미는 아니다. 과거에는 남성은 힘이 쎄기에 가정을 지키고 보호하는 역할이고 여성은...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-2-4/",
    "teaser": null
}, {
    "title": "2020년 도서목록",
    "excerpt": "머리말  2020년 도서 목록입니다. 주로 개발 서적이 될 것 같지만 다양한 책을 읽도록 노력하겠습니다.   도서 목록     객체지향의 사실과 오해(2독)   팀개발을 위한 Git &amp; GitHub(1독)   그림으로 배우는 HTTP &amp; Newwork basic (2독)   Do it 자료구조와 함께 배우는 알고리즘 입문 - 자바편 (1독)   ",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/2020%EB%85%84-%EB%8F%84%EC%84%9C%EB%AA%A9%EB%A1%9D/",
    "teaser": null
}, {
    "title": "책리뷰   스프링 입문을 위한 자바 객체 지향의 원리와 이해",
    "excerpt": "기본 정보 지은이 : 김종민 출판사 : 위키북스 기간 : 2020.02.24 ~ 2020.00.00 (약 00일) 저자는 책의 초반부에 이렇게 말한다. “의지는 하되 믿지는 말자. 특히 책의 저자에 대한 절대적 믿음은 금물이다.” 라고 말이다. 책을 쓴 저자가 직접 자신에 대한 절대적 믿음을 피하라고 한다. 나를 돌아봤다. 최근에 ‘객체 지향의 사실과 오해’라는...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85%EB%A6%AC%EB%B7%B0-%EC%8A%A4%ED%94%84%EB%A7%81-%EC%9E%85%EB%AC%B8%EC%9D%84-%EC%9C%84%ED%95%9C-%EC%9E%90%EB%B0%94-%EA%B0%9D%EC%B2%B4-%EC%A7%80%ED%96%A5%EC%9D%98-%EC%9B%90%EB%A6%AC%EC%99%80-%EC%9D%B4%ED%95%B4/",
    "teaser": null
}, {
    "title": "한번에 많이보단 매일 조금씩",
    "excerpt": "글또로 꾸준함을 얻자. 올해 들어 처음 비개발 서적을 읽고 있다. ‘그릿’이라는 책이다. 누나와 약속 전에 시간이 남아 서점에서 잠깐 5분 정도 읽었는데 흥미가 생겨서 알라딘 중고 서점에서 구매했다. 부제가 가장 끌렸다. ‘IQ, 재능, 환경을 뛰어넘는 열정적 끈기의 힘’이다. IQ, 재능, 환경, 이 세 가지 모두가 나에게 해당이 안 돼서 끌렸나...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%ED%95%9C%EB%B2%88%EC%97%90-%EB%A7%8E%EC%9D%B4%EB%B3%B4%EB%8B%A8-%EB%A7%A4%EC%9D%BC-%EC%A1%B0%EA%B8%88%EC%94%A9/",
    "teaser": null
}, {
    "title": "책 정리   자바 orm 표준 jpa 프로그래밍",
    "excerpt": "목차 JPA 소개 JPA 시작 영속성 관리 엔티티 매핑 연관관계 매핑 기초 다양한 연관관계 매핑 고급 매핑 프록시와 연관관계 관리 값 타입 객체지향 쿼리 언어 웹 애플리케이션 제작 스프링 데이터 JPA 웹 애플리케이션과 영속성 관리 컬렉션과 부가 기능 고급 주제와 성능 최적화 트랜젝션과 락, 2차 캐시 1. JPA 소개 객체...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%EC%9E%90%EB%B0%94-ORM-%ED%91%9C%EC%A4%80-JPA-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%98%EB%B0%8D/",
    "teaser": null
}, {
    "title": "장기목표를 달성하는 법",
    "excerpt": "장기 목표를 달성하는 법은 무엇일까? 나는 단기적인 목표를 곧잘 달성한다. 한 권의 책 읽기, 인터넷 1강좌 완강하기 등등. 비교적 1~2달 이내로 끝날 목표들이다. 하지만 나는 3개월 이상 투자하는 장기적인 목표 달성엔 머리가 지끈지끈 아프다. 이유가 무엇일까? 바로 익숙하지 않기 때문이다. 달성한 적이 없으니까 달성하려니 어려울 뿐이다. 다른 이유는 없다. 그럼...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%9E%A5%EA%B8%B0%EB%AA%A9%ED%91%9C%EB%A5%BC-%EB%8B%AC%EC%84%B1%ED%95%98%EB%8A%94-%EB%B2%95/",
    "teaser": null
}, {
    "title": "책 정리 순서",
    "excerpt": "주의사항 : 책 정리는 블로그 올릴 때 비공개로 한다. 저작권 문제 발생 가능.   1. 1독하며 중요한 키워드를 밑줄친다.   2. 1독한 키워드를 내가 이해한 언어로 적어본다. 어려울 땐 책보기.  ",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%EC%88%9C%EC%84%9C/",
    "teaser": null
}, {
    "title": "책 정리    스프링 입문을 위한 자바 객체 지향의 원리와 이해",
    "excerpt": "목차 사람을 사랑한 기술 자바와 절차적/구조적 프로그래밍 자바와 객체 지향 자바가 확장한 객체 지향 객체 지향 설계 5원칙 - SOLID 스프링이 사랑한 디자인 패턴 스프링 삼각형과 설정 정보 스프링 MVC를 이용한 게시판 구축 자바 8 람다와 인터페이스 스펙 변화 1. 사람을 사랑한 기술 필자를 의지는 하되 믿지는 말자. 인간은 사랑을...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%EC%8A%A4%ED%94%84%EB%A7%81-%EC%9E%85%EB%AC%B8%EC%9D%84-%EC%9C%84%ED%95%9C-%EC%9E%90%EB%B0%94-%EA%B0%9D%EC%B2%B4-%EC%A7%80%ED%96%A5%EC%9D%98-%EC%9B%90%EB%A6%AC%EC%99%80-%EC%9D%B4%ED%95%B4/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 남현욱님의 취미로 하는 알고리즘 문제풀이 영상을 시청했다. 알고리즘을 공부로만 생각했던 나지만 현욱님은 재미있어서 하신다고 한다. 최근 조영호 작가님도 글쓰는 일이 재밌어서 하신다고 한다. 나도 공부로 느끼지 말고 알고리즘과 글쓰기에 재미를 느끼며 해봐야겠다. 이동욱님의 블로그 기억보단 기록을과 이현주님의 블로그 초보몽키의 개발공부로그을 돌아다녔다. 두 분의 블로그를 보면서 내 블로그도 업그레이드를 하고...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 스프링으로 QnA 게시판 만들기 step3 구현. 로그인 기능을 구현하니 그 뒤에 로직이 로그인과 관련됐다. 생각보다 까다로웠다. 항상 로그인을 했느냐 안했느냐를 예외처리해야 한다. 코드 수정하면 바로 웹도 수정되는 reload 기능을 빨리 도입해야겠다.. 코드 작성보다 웹 테스트 시간이 더 많이 소요되는 느낌. 아니면 TDD를 공부해도 좋을 것 같다. 객체간 매핑을 적용했다....",
    "categories": [],
        "tags": [],
        "url": "http://localhost:4000/TIL/",
        "teaser": null
      },{
        "title": "Til",
        "excerpt":"회고 스프링으로 QnA 게시판 만들기 step3 중 답변 수정 기능 구현 어제부터 model에서 answer의 id를 못 가져오는 이슈가 있었는데!! getter가 없었기 때문이었다. 예상대로 간단한 문제였지만 꽤나 많은 시간을 소요했다. 덕분에 handlebars에서 부모 객체에 접근하는 방법(../ or @root)도 알 수 있었다. Step3 반복주기 2번. 반복하면 속도는 느리지만, 느린 건 없다. 속도는...","categories": [],
        "tags": [],
        "url": "http://localhost:4000/TIL/",
        "teaser": null
      },{
        "title": "Til",
        "excerpt":"회고 생활패턴 29일(토)부터 1시에 잤다. 11시~7시 생활패턴을 2달간 유지했는데 변화가 오고 있다. 1~2일은 step3 미션 진행하느라 늦어졌다. 오늘 마무리할 일을 오늘 다 하고 자는 습관이 효과적일까 확인하는 중이다. 오늘 일어나는 시간이 11시였는데.. 효과적인 건 아직까진 모르겠다.. 건강 요즘 병원 갈 일이 많다.. 목요일엔 결절종 수술 예정, 사마귀 치료는 꾸준히 하고...","categories": [],
        "tags": [],
        "url": "http://localhost:4000/TIL/",
        "teaser": null
      },{
        "title": "Til",
        "excerpt":"회고     건강            충치 치료를 했다. 다음주에 한번 더 가야한다. 1시간 남짓 치료였지만 그래도 심신이 지친다. 컨디션이 별로다.           스프링으로 QnA 게시판 만들기 step4            자바지기 영상 시청하며 step4 진행했다. 주로 리팩토링이 주제였고 미션 구현은 내일 병원 입원 후 진행할 예정이다.          ","categories": [],
        "tags": [],
        "url": "http://localhost:4000/TIL/",
        "teaser": null
      },{
        "title": "Til",
        "excerpt":"회고     건강            원없이 병원에서 쉬었다. 그간 보고싶던 원피스도 원없이 봤다. 기분은 쏘쏘이다.          ","categories": [],
        "tags": [],
        "url": "http://localhost:4000/TIL/",
        "teaser": null
      },{
        "title": "Til",
        "excerpt":"회고 건강 2박3일 입원 치료 마무리했다. 입원해서도 꾸준히 책을 읽고 싶었는데 3.5시간 정도 읽었다. 나머지는 원피스(도플라밍고편, 토드랜드편), 주토피아, 드라마(하이에나, 이태원클라쓰)를 봤다. 그간 보고 싶었던 컨텐츠를 원없이 봤다. 특히 원피스는 작년 이후 처음으로 시간 내서 봤다. 생산적이지 못했나 하는 아쉬움도 남지만 크진 않다. 누워있어야 하는 상황에서 책을 계속 읽는 게 쉽지...","categories": [],
        "tags": [],
        "url": "http://localhost:4000/TIL/",
        "teaser": null
      },{
        "title": "Til",
        "excerpt":"회고     스프링으로 QnA 게시판 만들기 step4            이번 step에서 ORM을 약간 맛 본 느낌. 과거 호눅스가 ORM을 잘 쓰려면 객체지향과 DB에 대해 잘 알아야 한다고 했는지 이해가 된다. JPA의 기능이 DB를 잘 모르면 100% 사용할 수 없는 구조다. 근데 새삼 느끼지만 스프링은 진짜 잘 만들었다. 아직 더 느껴야겠지만          ","categories": [],
        "tags": [],
        "url": "http://localhost:4000/TIL/",
        "teaser": null
      },{
        "title": "Til",
        "excerpt":"회고 목표관리 피드백없이 살아가는 느낌. 의욕이 없다. 체크리스트를 작성하지만 형식적으로 하고 있다. 달성 못했다면 다음주엔 달성하고자 노력이 필요한데 그런 의지도 없었다. 왜 그럴까. 최근에 아파서일까? 운동을 못하면서 늦잠을 자고 생활패턴이 무너지기 시작해서일까? 무언가 에너지가 없는 건 확실하다. 꾸준함을 모토로 살아가자던 마음은 어디로 갔나. 다시 하면된다. 욕심내지 않고 하나씩 잡아나가면 된다....","categories": [],
        "tags": [],
        "url": "http://localhost:4000/TIL/",
        "teaser": null
      },{
        "title": "Til",
        "excerpt":"회고 하루 정리 본집에 있으니 가족들과 시간을 보내니 하루 마무리가 잘 안된다. 오늘 할 일을 오늘 다 하자는 꾸준함은 어디로 갔는지.. 체크리스트, TIL업로드를 당일에 안하고 다음날 아침에 하고 있다. 좋지 않은 징조. 경각심을 갖자. 자료구조 gcd, 하노이, 퀵정렬 복습했다. 어제부터 자료구조 공부를 차근차근 하는 중. 재귀 : 어떤 사건이 자기...","categories": [],
        "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고     자료구조            자료구조 구현할 때 삽입 및 삭제할 때 isEmpty()를 확인해야 한다. 놓치기 쉽다.           쓰레드            쓰레드란 실행 흐름을 제어하는 주체이다. 멀티쓰레드를 사용할 땐 동기화를 적절하게 사용해야 한다.          ",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 알고리즘 leetcode에서 test code는 통과하는데 submit이 실패하는 경우. 함수 시작할 때 스택이나 큐를 비워야 한다. leetcode에서는 여러가지 케이스르 넣기 때문에 스택을 이용하면 비워줘야 한다. Ajax Ajax 이용해 Json 데이터를 뽑을 때는 객체 간의 Mapping을 생각해야 한다. 양방향 매핑이면 연속 chain이 일어난다. 함께 자리기 Step5를 진행하면서 오류가 발생했는데, 이전에 오류를...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 Ajax Ajax을 구현 했는데 동작을 안한다. 새로고침 해야 적용이 되는데 이러면 Ajax를 쓰는 의미가 없다. 방법을 찾자! 버그가 발생하는데 익숙치 않아서 디버그가 쉽지 않다. 이번주 안에 Step6는 끝내고 싶었는데 대충 넘어갈 순 없지.. 디버그를 확실히 하고 넘어 가야겠다. 다시 영상을 참고하며 문제를 발견했고, Jay에게 도움을 요청했다. 혼자 공부하는 것보다...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "철학   feminism 3 1",
    "excerpt": "목차 공리주의 여성의 종속을 쓴 밀 내 생각 공리주의 공공의 이익에 대한 관심을 갖는 철학이다. 사회 정의를 실현하기 위해선 어떻게 해야할까에 대한 고민을 한다. 행위자의 의도는 알 수 없다 생각하고, 의도보단 행동(결과)에 초점을 맞춘다. 여성의 종속을 쓴 밀 밀은 공동체의 행복을 고민하는 공리주의자인데, 사회 속 여성의 억압이 단순히 개인의 피해를...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-3-1/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 회고를 피드백하다. 이번달부터 시작한 TIL을 쭉 읽었다. 최근에 형식적으로 하는 것 같아 초심을 기억하고 싶었다. 무엇을 배웠고, 배우면서 어떤 것을 깨달았는지 적어야 하는데 단순하게만 적고 있었다. ex) ~~을 배웠다. 하나 끝날 때마다 적는 습관을 들이자. QnA 게시판 만들기 Ajax를 이용해 답변 추가 기능을 구현했다. Ajax는 클라이언트와 서버가 소통하도록 도와주는...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "목표관리는 tdd처럼",
    "excerpt": "목표 관리를 TDD처럼 하자! 무슨 말일까. 최근 TDD를 배우니 내가 하는 목표 관리의 원리와 비슷하다고 느꼈다. 핵심은 결과를 예상하고 그 결과를 달성하기 위해 노력하는 점이다. 먼저 TDD에 대한 의미를 살펴보자. TDD(Test Driven Development)는 테스트를 기반으로 개발하는 방식이다. 내가 얻고자 하는 결과를 미리 지정하고 그 결과가 나올 수 있게 코드를 짜는...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EB%AA%A9%ED%91%9C%EA%B4%80%EB%A6%AC%EB%8A%94-TDD%EC%B2%98%EB%9F%BC/",
    "teaser": null
}, {
    "title": "목표관리는 tdd처럼",
    "excerpt": "목표 관리를 TDD처럼 하자! 무슨 말일까. 최근 TDD를 배우니 내가 하는 목표 관리의 원리와 비슷하다고 느꼈다. 핵심은 결과를 예상하고 그 결과를 달성하기 위해 노력하는 점이다. 먼저 TDD에 대한 의미를 살펴보자. TDD(Test Driven Development)는 테스트를 기반으로 개발하는 방식이다. 내가 얻고자 하는 결과를 미리 지정하고 그 결과가 나올 수 있게 코드를 짜는...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EB%AA%A9%ED%91%9C%EA%B4%80%EB%A6%AC%EB%8A%94-TDD%EC%B2%98%EB%9F%BC/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고     시간 관리            지난주 지적 목표 달성률이 25%.. 노원 이동 시간이 독서 시간이었는데, 본집으로 온 뒤 늦잠이 대체하고 있다. 독서 시간을 배정해야 한다.           QnA 게시판 만들기            오늘부터 페어프로그래밍 시작이다. 혼자할 때보다 시간은 더 걸리겠지만 시너지를 기대하며..!           알고리즘 문제            hash를 적절히 이용해서 문제를 풀고 있다. 점점 익숙해지는 느낌!!          ",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "왜 하고 싶은가에 대해 확신하지 못할 때",
    "excerpt": "최근 힘이 빠졌다. 수술하고 아팠다고 핑계를 댈 수 있지만, 이미 스스로 핑계라고 느끼고 있다. 아픈 건 큰 원인이 아니다. 그럼 무엇일까? 개발에 대한 열정이 1달 전보다 사그라든 느낌. 개발이 즐겁기보단 일처럼 반드시 해야 하는 일로 느껴지는 마음은 어디서 오는 걸까? ‘왜 개발자를 하고 싶은가’에 대한 뚜렷한 답이 없기 때문이다. 오랜...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%99%9C-%ED%95%98%EA%B3%A0-%EC%8B%B6%EC%9D%80%EA%B0%80%EC%97%90-%EB%8C%80%ED%95%B4-%ED%99%95%EC%8B%A0%ED%95%98%EC%A7%80-%EB%AA%BB%ED%95%A0-%EB%95%8C/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 알고리즘 이진트리의 검색과 삽입을 구현했다. 알고리즘 책을 참고해서 구현했는데 머리에서 바로 구조가 떠오르지 않아서 답답하다. 처음 구현하는 이진트리니 욕심내지 않고 천천히 해보자. char[]는 stream으로 사용하려면 복잡하다. 그냥 for문 쓰기. replace와 replaceFirst의 차이 : replace는 일치하는 값 여러개 삭제 페이징 오전만 해도 어떻게 구현할지 생각이 안 떠올랐는데 페어프로그래밍을 통해 해결!...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "꾸준함을 얻기 위해선",
    "excerpt": "꾸준함. 최근 내 삶에서 가장 중요한 키워드다. 개발 공부를 늦게 시작했다 생각하기에 내가 가질 무기는 꾸준함이다. 꾸준함은 재능이 아니라 습관으로 만들어진다고 믿기 때문이다. 그런데 이 꾸준함이 참 어렵다. 최근에 아프고 심적으로 지치니 꾸준함이 무너진다. 생활 패턴의 꾸준함, 하루 정리의 꾸준함. 개발 공부의 꾸준함 등. 무언가 하고 있긴 하지만, 방향 없이...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EA%BE%B8%EC%A4%80%ED%95%A8%EC%9D%84-%EC%96%BB%EA%B8%B0-%EC%9C%84%ED%95%B4%EC%84%A0/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 백기선님 강의 : 좋은 개발자가 되는 법 디버거를 적극적으로 활용해라. TDD를 작성해라. (물론 잘). 책 추천 : 켄트 백의 테스트주도개발. JUnit은 4로 연습해라. 현업 대부분 4로 코드가 작성되어 있다. mock에 대해서도 알아야 하는데 mockito 추천한다. 이후 Dbunit, Htmlunit도 존재한다. 인텔리J 설정 IntelliJ brace 색깔 바꾸고 싶을 때 : setting...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 스프링 스프링에서 Junit4 사용하는 법 익히기. 현재 사용하려면 jar파일 가져오라고 하는데 문제 해결이 필요하다. CSS파일 못 가져올 때 pagkage 빌드를 다시 해보기. Git git stash 사용 및 원고 작성 자료구조 이진검색트리 삭제 기능이 경우의 수가 3가지로 나눠져서 원리는 이해되는데, 코드로 보려니 어렵다. 해시법 머리가 안돌아가나.. 연결리스트로 구현되는 해시법에 대한...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "책리뷰   do it 알고리즘 자바편",
    "excerpt": "기본 정보 지은이 : 보요 시바타 옮긴이 : 강민 출판사 : 위키북스 기간 : 2020.01.27 ~ 2020.03.20 (약 50일) 1독 기간이 대략 50일이 소요됐다. 목표는 2월 안에 끝내고 싶었는데 예상보다 지연됐다. 이유는 여러가지가 있다. 책 내용이 어려워지면서 손에서 멀어지기도 했고, 발 수술하고 입원하면서 생활패턴이 무너지면서 책을 못 읽었다. 이유가 어떻게...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85%EB%A6%AC%EB%B7%B0-Do-it-%EC%95%8C%EA%B3%A0%EB%A6%AC%EC%A6%98-%EC%9E%90%EB%B0%94%ED%8E%B8/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 자료구조 ‘Do it 알고리즘 자바편’ 1독 완료 및 책리뷰 원고 작성 백기선 스프링 강의 오늘 수강 스프링 빈 의존성 주입 스프링 AOP 프록시 패턴 Spring MVC 테스트 코드 치명적인 단점 MVC 테스트는 Controller가 작동을 하는 지 안하는 지만 체크할 뿐 서버에서 제대로 동작하는 지는 알 수 없다. 만약 컨트롤러가...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "TIL QnA 게시판 반복 자체 요구 사항 테스트는 PostMan 활용하기 개발 환경 설정 및 중요한 사항은 각 step README에 빠짐없이 정리 리팩토링은 Result 방법 사용해서 하기. 반복할 때 Test Code를 작성할까 고민했지만 Postman만 사용하기로 결정. 이유는 시간은 부족한데 Test에 익숙하지 않아서 배우는 시간이 필요. repeat-java-qna 저장소 생성 후 진행. Postman으로...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "철학   feminism 3 2",
    "excerpt": "목차 여성이 자신의 종속에 대해 동의했는가? 여성의 종속은 관습일 뿐이다. 여성이 자신의 종속에 대해 동의했는가? “여성과 남성의 본성이 다르다.”는 주장에 밀은 그건 관습에 불가하다고 말한다. 과거 스파르타는 여성도 남성과 함께 군사 훈련을 받았다. 이것처럼 각 사회에 있는 관습에 따라 남성과 여성의 역할이 만들어졌다고 말한다. “무엇보다 여성의 종속에 대해서 여성들이 동의를...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-3-2/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "오늘 할 일 그라운드룰 정하기 호눅스 수업 Swagger Swagger란? 클라이언트 개발자와 백엔드 개발자가 소통하는 방법을 기록한 API 명세서 OpenApi : RestAPI를 위한 표준 명세 규격을 의미. 어떻게 데이터 타입으로 주고 받을지 소통하는 방법. Spring boot에서 사용법 Swagger 라이브러리 추가하기 compile group: 'io.springfox', name: 'springfox-swagger2', version: '2.9.2' compile group: 'io.springfox', name:...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 팀 그라운드 룰 설정 온라인으로 진행하지만 시간을 정하니 모임은 수월하다는 걸 느낌. 커밋 방식, JSON, URL 방식을 팀원들이랑 정했다. 프로젝트 개발환경 셋팅 Jdbc 셋팅에 시간을 엄청 썼다. 시간이야 쓸 수 있지만 아쉬운 점은 기록을 안했다는 점이다. 초조해지니 주먹구구식으로 어떻게든 해결하려고 노력한다. 그러다 시간은 2~3시간이 지나간다. 이쯤 되면 내가 뭘했는지...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "삽질 PostMan -PostMan 이용해 Mock server 생성하고 request가 오면 지정한 response를 반환하는 서비스 구축 중. user-id-vaildation은 되는데 email은 안됨. - [x] request body의 차인가 싶어서 시도 - [x] URL을 다시 확인하기. - [x] example의 method 차이였음. get이면 성공, post면 실패 -&gt; url로 보는 건 get방식만 가능. Heroku로 API 배포 heroku로...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "회고 온라인으로 프로젝트를 진행하니 문제가 발생했을 때 대처가 느린 것 같다. 확실히 책임감이 줄어드는 것 같다. 보통 문제는 혼자서 해결할 수 없기에 최소 2명이서 발 빠르게 대처를 해야 한다. 그런데 한 명이 피드백이 느려지면 문제 해결이 멈춘다. 단지 온라인이라서 일 수 도 있지만 프로젝트를 어떻게 운영할 지에 대한 고민도 필요하다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIL/",
    "teaser": null
}, {
    "title": "공부보단 프로젝트를",
    "excerpt": "요즘 학원에서 프로젝트를 하고 있다. 처음으로 클라이언트 개발자와 함께 어플리케이션을 개발하고 있다. 욕심이 있는 걸까. 프로젝트 진행하면서 모르는 지식도 많아서 부딪히면서 공부를 하고 있다. 그럼에도 공적인 프로젝트 외에 내 개인의 성장을 고민하게 된다. 욕심이 생기는 게 맞는 것 같다. 현재 진행하는 프로젝트도 손쉽게 할 수 있는 수준은 아닌데.. 고민은 된다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EA%B3%B5%EB%B6%80%EB%B3%B4%EB%8B%A8-%ED%94%84%EB%A1%9C%EC%A0%9D%ED%8A%B8%EB%A5%BC/",
    "teaser": null
}, {
    "title": "자극",
    "excerpt": "자극이 없다면 현재 생활에 안주하는 성향이라는 걸 다시 한번 깨닫는다. 이 글을 쓰는 2020년 3 월은 방향없이 걸었던 달이다. 학원 프로젝트가 있으니 개발은 하나 왜 하는지, 무엇을 위해 하는지 목표의식이 없이 했던 3월이다. 그러다 3 월 회고를 하면서 깨달았다. 자극이 없으니 현재 상황에 안주했다는 사실을 깨달았다. 왜 안주했을까? 아니면 왜...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%9E%90%EA%B7%B9/",
    "teaser": null
}, {
    "title": "철학   feminism 3 3",
    "excerpt": "참고 강의, 김은주의 페미니즘 : http://m.artnstudy.com/n_lecture/LecDetail.asp?LessonIdx=ejkim001#viewplay 목차 본성에 대한 밀의 비판 메리 울스턴크래프트와 밀의 차이 여성이 직접 이야기하게 하자. 내 생각 본성에 대한 밀의 비판 남성이 사회를 이끌어가고 여성이 사회 속에서 종속이 되는 이유는 본성 때문이라는 주장이 있다. 과거부터 힘이 쎈 남성은 가정을 지키기 위해 노력했고 여성은 가정 안에서 가정을...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-3-3/",
    "teaser": null
}, {
    "title": "Til",
    "excerpt": "TIL 백기선씨 강의 보고 깃허브 Writing 저장소 관리가 필요하다는 생각이 든다. Writing이라는 저장소에 다양한 원고를 저장하고 있는데 Study라는 저장소로 만들어서 공부만 기록하는 저장소 만들까 생각 중. 인터뷰의 질문 수준이 높다. ex1) 프로젝트 마감은 다가오고 리소스는 없는 상황에 어떻게 했느냐. ex2) 지난 프로젝트의 아키텍쳐에 대해 설명해달라. 스프링을 제대로 공부하고 싶어서 토비...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/TIl/",
    "teaser": null
}, {
    "title": "철학   feminism 3 4",
    "excerpt": "목차 자유가 없는 사회에서 권력을 탐낸다. 내 생각 자유가 없는 사회에서 권력을 탐낸다. 밀의 주장은 자유론에 기반을 둔다. 여성의 종속이 옳지 않은 이유는 여성의 자유를 빼앗기 때문이다. 또한 개인이 자유로울 때 공동체 모두에게 이익인데, 여성이 종속되면 다양한 재능과 능력이 묻히기 때문에 그 공동체에도 불이익이다. 밀은 개인의 자유가 없는 사회에서 사람들은...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-3-4/",
    "teaser": null
}, {
    "title": "책 리뷰   모두의 네트워크",
    "excerpt": "기본 정보     지은이 : 미즈구치 카츠야   옮긴이 : 이승룡   출판사 : 길벗   기간 : 2020.04.07 ~ 2020.00.00 (약 00일)  ",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EB%A6%AC%EB%B7%B0-%EB%AA%A8%EB%91%90%EC%9D%98-%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC/",
    "teaser": null
}, {
    "title": "철학   feminism 4 1",
    "excerpt": "개요 김은주의 페미니즘 의 수업 내용과 내 생각을 정리한 글. 목차 제2의 성 우리는 하나의 의미 내 생각 제2의 성 시몬 드 보부아르의 책이다. 페미니즘의 대표적인 책이지만 이 책을 다 읽은 사람은 많지 않다는 이야기도 나온다. 이 책의 1부에서는 역사 속에서 어떻게 여성이 타자로 존재했는지와 여성이 타자로 존재하는 것이 많은...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-4-1/",
    "teaser": null
}, {
    "title": "책 정리   모두의 네트워크",
    "excerpt": "목차 네트워크 첫 걸음 네트워크의 기본 규칙 물리 계층 : 테이터를 전기 신호로 변환하기 테이터 링크 계층 : 랜에서 데이터 전송하기 네트워크 계층 : 목적지에 데이터 전달하기 전송 게층 : 신뢰할 수 있는 데이터 전송하기 응용 계층 : 애플리케이션에 데이터 전송하기 네트워크의 전체 흐름 살펴보기 무선 랜 이해하기 1장 네트워크...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%EB%AA%A8%EB%91%90%EC%9D%98-%EB%84%A4%ED%8A%B8%EC%9B%8C%ED%81%AC/",
    "teaser": null
}, {
    "title": "철학   feminism 4 2",
    "excerpt": "개요 김은주의 페미니즘 의 수업 내용과 내 생각을 정리한 글. 목차 프로이트에 대한 보부아르의 비판 페미니즘의 출발점 내 생각 프로이트에 대한 보부아르의 비판 프로이트는 정신분석학에서 이런 말을 한다. 여성은 남성의 페니스를 선망하는 욕망을 가지고 있다. 일명 페니스 엔비(Pennis envy)가 있다고 한다. 여성은 페니스가 없기 때문에 페니스를 갖기 위해 시기와 질투가...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-4-2/",
    "teaser": null
}, {
    "title": "철학   feminism 4 3",
    "excerpt": "개요 김은주의 페미니즘 의 수업 내용과 내 생각을 정리한 글. 목차 타자인 여성의 투쟁은 없는가? 페미니즘에서 구체적인 사례가 나오는 이유 내생각 타자인 여성의 투쟁은 없는가? 보부아르는 여성이 타자로 억압을 받아왔지만 투쟁은 없었다고 말한다. 이 점이 다른 투쟁과 다른 점이라고 말한다. 예를 들어, 부르주아는 주체로 존재하고 프롤레타리아는 주체에 반하는 타자로 존재했다....",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-4-3/",
    "teaser": null
}, {
    "title": "책 정리   데이터베이스 첫걸음",
    "excerpt": "목차 3. 데이터베이스에 얽힌 돈 이야기 EOSL이란 End Of Service Life이다. 서비스의 지원이 얼마나 남았는 지 알려주는 지표이다. 4. 데이터베이스와 아키텍쳐 구성 Stand-alone 이란 DB가 네트워크에 접속하지 않고 물리적으로 독립되어 운영되는 상태 Web 3계층이란 클라이언트 요청을 처리하는 계층이 3개이다. 서버 계층 - 어플리케이션 계층 - DB 계층. 클러스터란 복수의 컴포넌트(사물)로...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B1%85-%EC%A0%95%EB%A6%AC-%EB%8D%B0%EC%9D%B4%ED%84%B0%EB%B2%A0%EC%9D%B4%EC%8A%A4-%EC%B2%AB%EA%B1%B8%EC%9D%8C/",
    "teaser": null
}, {
    "title": " 철학   feminism 강의 수강 후",
    "excerpt": "개요 김은주의 페미니즘 강의를 모두 수강한 후 느낀점 내 생각 올해 1월부터 한 주에 1강씩 수강했던 페미니즘 강의를 모두 수강했다. 호기심에 시작했던 강의였고 꾸준히 수강한 뒤 목표를 달성해서 뿌듯하다. 강의 수강한 지금 나는 어떻게 가치관이 변화했을까?에 대한 답을 해보려 한다. 당연하다고 생각했던 여성의 권리에 대해서 이전보다 예민하게 인식할 수 있게...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-%EA%B0%95%EC%9D%98-%EC%88%98%EA%B0%95-%ED%9B%84/",
    "teaser": null
}, {
    "title": "철학   feminism 4 4",
    "excerpt": "개요 김은주의 페미니즘 의 수업 내용과 내 생각을 정리한 글. 목차 여성의 행복은 남자를 잘 만나는 것? 여성의 행복은 남자를 잘 만나는 것? 보부아르는 다양한 반론에 대해서 생각했다. 어떤 사람들은 이렇게 말할 수 있다. “왜 이렇게 힘들게 살아가느냐. 페미니스트로 살아가니 사회에서 욕 먹고 사람들이 싫어하는 것 아니냐. 그냥 단순하게 여자로써...",
    "categories": [],
    "tags": [],
    "url": "http://localhost:4000/%EC%B2%A0%ED%95%99-Feminism-4-4/",
    "teaser": null
}]
